Repository: ThePortoGeese/mobile_gaya_ant
Catalog: lib/l10n/app_*.arb
Languages: fr, pt

# language
source: English
fr: Français
pt: Português

source: App Language
fr: Langue de l'application
pt: Linguagem da Aplicação

# appBarText
source: Robot Ant Control
fr: Contrôle du Robot Fourmi
pt: Controlo do Robô Formiga

source: Connection Status
fr: État de la Connexion
pt: Estado de Conexão

# disconnectedStatus
source: DISCONNECTED
fr: DÉCONNECTÉ
pt: DESCONECTADO

source: Connect
fr: Connecter
pt: Conectar

source: Disconnect
fr: Déconnecter
pt: Desconectar

source: Connected to Device
fr: Connecté à l'appareil
pt: Conectado ao dispositivo

source: Bluetooth Error
fr: Bluetooth Erreur
pt: Erro Bluetooth

source: Yes
fr: Oui
pt: Sim

source: No
fr: Non
pt: Não

source: Bonding Error
fr: Erreur d'appairage
pt: Erro de Emparelhamento

# bondingErrorMessage
source: An error occurred while bonding to the device.
fr: Une erreur s'est produite lors de l'appairage de l'appareil
pt: Houve um erro a emparelhar o dispositivo

# bluetoothOffMessage
source: Seems your bluetooth is turned off. Do you wish to turn it on?
fr: Il semble que votre Bluetooth soit désactivé. Voulez-vous l'activer?
pt: Parece que o seu bluetooth está desligado. Pretende ligá-lo?

# bluetoothNotAvailableMessage
source: Your device doesn't support bluetooth technology. We will close the application now.
fr: Votre appareil ne prend pas en charge la technologie Bluetooth. Nous allons fermer l'application.
pt: O seu dispositivo não suporta tecnologia bluetooth. Iremos fechar a aplicação agora.

source: Connection Error
fr: Erreur d'connexion
pt: Erro de Conexão

# connectionErrorMessage
source: An error occurred while connecting to the device.
fr: Une erreur s'est produite lors de la connexion à l'appareil
pt: Houve um erro a conectar com o dispositivo

# searchingDevices
source: Searching for devices...
fr: Recherche d'appareils...
pt: A procurar dispositivos...

source: Connecting to device
fr: Connexion à l'appareil
pt: A conectar ao dispositivo

source: Grab
fr: Saisir
pt: Agarrar

source: Attack
fr: Attaque
pt: Atacar

source: Dance
fr: Danser
pt: Dançar

# velocity
source: Speed
fr: Velocité
pt: Velocidade

source: Disconnected from device
fr: Déconnecté de l'appareil
pt: Desconectado do dispositivo

# permissionsError
source: Permission Error
fr: Erreur d'autorisation
pt: Erro de Permissão

# permissionsErrorMessage
source: You must accept permissions for the app to run.
fr: Vous devez accepter les autorisations pour que l'application fonctionne.
pt: Têm de aceitar permissões para a aplicação funcionar.

source: Release
fr: Baisse
pt: Largar

source: Stop
fr: Pour arrêter
pt: Parar

source: Password Necessary
fr: Mot de Passe Requis
pt: Palavra-chave Necessária

# passwordNecessaryMessage
source: Insert the device's password:
fr: Entrez le mot de passe de l'appareil:
pt: Introduza a palavra-chave do dispositivo:

# errorSearching
source: An Error Occured while Searching Devices
fr: Erreur Bluetooth
pt: Erro ao pesquisar dispositivos

# errorSearchingMessage
source: Try restarting the application.
fr: Une erreur s'est produite lors de la recherche des appareils. Essayez de redémarrer l'application.
pt: Experimente abrir a aplicação de novo.

source: Welcome!
fr: Bienvenue!
pt: Bem Vindo!

# welcomeMessage1
source: This application serves as controls for the robot ant project here at ISPGAYA. You can connect the robot via bluetooth by pressing the "Connect" button
fr: Cette application contrôle la fourmi robot d'ISPGAYA. Connectez-la via Bluetooth en appuyant sur le bouton « Connecter ».
pt: Esta aplicação serve como controlo da formiga robô aqui no ISPGAYA. Conecta a formiga por bluetooth ao pressionar o butão "Conectar"

# welcomeMessage2
source: Select the robot and introduce the given password. Keep in mind that this app will only connect to the ant and trying to do anything else might cause unexpected behaviour.
fr: Sélectionnez le robot et saisissez le mot de passe fourni. Cette application ne peut se connecter qu'au robot ; toute tentative de connexion à un autre appareil peut entraîner un comportement inattendu.
pt: Seleciona o robô e introduz a palavra-chave dada. Esta app consegue apenas conectar ao robô e tentar conectar a outro dispositivo poderá resultar em comportamento inesperado.

# welcomeMessage3
source: When connected, the controls for the ant will appear, allowing you direct control over its movements.
fr: Une fois connecté, les commandes du robot apparaîtront, vous permettant de contrôler directement ses mouvements.
pt: Quando conectado, os controlos do robô irão aparecer, permitindo-te controlo direto dos seus movimentos.

# welcomeMessage4
source: This app requires you to grant it bluetooth permissions.
fr: Cette application nécessite des autorisations Bluetooth pour fonctionner.
pt: Esta aplicação necessita de permissões bluetooth para funcionar.

# credits
source: Made by David Jo√£o at ISPGAYA
fr: Réalisé par David João à ISPGAYA
pt: Feito pelo David João no ISPGAYA
